{
  "name": "Coq Au Vin",
  "type": "Main",
  "description": "A classic French braised chicken dish that uses forgiving bone-in dark meat and builds an incredibly savory sauce from wine, bacon, vegetables, and stock.",
  "gist": "Sear then braise chicken in a rich sauce made from wine, roux, vegetables, and chicken stock.",
  "ingredients": "Chicken (large pieces of bone-in, skin-on dark meat like leg quarters and thighs)\nBacon or pork belly (lardon)\nPearl onions\nMushrooms\nGarlic\n2–3 tbsp tomato paste\nButter and flour (for a roux)\n1 cup red wine\n1–2 cups chicken stock\nHerbs (e.g. herbes de Provence, about 2 tbsp total)\nRice or egg noodles for serving",
  "steps": "1. If using chicken quarters, break them down into legs and thighs.\n2. Chop bacon into small pieces.\n3. Peel pearl onions and chop mushrooms into bite-sized pieces, keeping them fairly chunky.\n4. Place bacon in a cold large pan and turn heat to low.\n5. Let bacon fully render, then remove and set aside.\n6. Increase heat and sear the chicken until nicely browned.\n7. Remove chicken, leaving about 1 tbsp of fat in the pan.\n8. Add onions and mushrooms to the pan, adding garlic partway through, and cook until colored.\n9. Lower heat and melt a few tablespoons of butter in the pan.\n10. Sprinkle in a few tablespoons of flour to form a roux.\n11. Add tomato paste and cook until caramelized.\n12. Deglaze with 1 cup of red wine when everything is close to burning.\n13. Reduce wine to about one-third, scraping up all fond.\n14. Add herbs and return bacon to the pan.\n15. Add 1 cup of chicken stock and stir to combine.\n16. Return chicken to the pan, skin side up, adding more stock until almost covered.\n17. Cover and gently simmer for about 1 hour, checking around 45 minutes.\n18. Once chicken is fall-apart tender, remove it from the pan.\n19. Skim off excess fat from the sauce if needed.\n20. Reduce sauce for 5–10 minutes while the chicken rests.\n21. Serve chicken over rice or noodles, spooning vegetables and sauce over top.",
  "notes": ""
}
